<?php

/**
 * ECSHOP 云起收银 语言文件
 * ============================================================================
 * * 版权所有 2005-2012 上海商派网络科技有限公司，并保留所有权利。
 * 网站地址: http://www.ecshop.com；
 * ----------------------------------------------------------------------------
 * 这不是一个自由软件！您只能在不用于商业目的的前提下对程序代码进行修改和
 * 使用；不允许对程序代码以任何形式任何目的的再发布。
 * ============================================================================
 * $Author: liubo $
 * $Id: yunqi.php 17217 2011-01-19 06:29:08Z liubo $
 */

global $_LANG;

$_LANG['yunqi'] = '<font color="#FF0000">天工收银</font>';
$_LANG['yunqi_desc'] = '<font color="#FF0000">天工收银是上海商派2015年正式推出的专业集成支付平台，致力于为各类用户提供融合、便捷、安全的场景支付服务。</font>';
$_LANG['pay_button'] = '立即支付';
$_LANG['appkey'] = '安全校验码（Client_id）';
$_LANG['appsecret'] = '安全密钥（Client_secret）';

