<?php

/**
* Russian language file
*
* @author Maxim Hodyrev <maximkou@gmail.com>
*/

$this->language = array(

    'clear_date'    => 'Дата очистки',
    'csrf_detected' => 'При выполнении вашего запроса возникла проблема.<br>Возможно, ваш запрос занял слишком много времени или дублируется.<br>Попробуйте еще раз.',
    'days'          => array('Воскресенье','Понедельник','Вторник','Среда','Четверг','Пятница','Суббота'),
    'days_abbr'     => false,
    'months'        => array('Январь','Февраль','Март','Апрель','Май','Июнь','Июль','Август','Сентябрь','Октябрь','Ноябрь','Декабрь'),
    'months_abbr'   => false,
    'new_captcha'   => 'Обновить капчу',
    'other'         => 'Еще...',
    'select'        => '- не выбрано -',
    'spam_detected' => 'Выявлена возможная попытка отправить спам-сообщение. Отправленные в форме данные отклонены.',
    'today'         => 'Сегодня',

);

?>